_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 110, 320, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 110, 320, 64)      4864      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 110, 320, 64)      102464    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 36, 106, 64)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 36, 106, 48)       76848     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 36, 106, 32)       13856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 18, 53, 32)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 18, 53, 24)        6936      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 18, 53, 16)        3472      
_________________________________________________________________
flatten_1 (Flatten)          (None, 15264)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               7815680   
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 8,196,665
Trainable params: 8,196,665
Non-trainable params: 0
_________________________________________________________________
