_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 65, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 65, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 65, 320, 128)      9728      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 80, 128)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 80, 64)        204864    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 26, 64)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 26, 48)         76848     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 26, 32)         13856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 13, 32)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 13, 24)         6936      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 2, 13, 16)         3472      
_________________________________________________________________
flatten_1 (Flatten)          (None, 416)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               213504    
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_3 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 65        
=================================================================
Total params: 701,753
Trainable params: 701,753
Non-trainable params: 0
_________________________________________________________________
